test/integration/data.pyvmomi.inv/request-5.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <RetrievePropertiesEx xmlns="urn:vim25">
      <_this type="PropertyCollector">propertyCollector</_this>
      <specSet>
        <propSet>
          <type>ContainerView</type>
          <all>false</all>
          <pathSet>view</pathSet>
        </propSet>
        <objectSet>
          <obj type="ContainerView">session[fbc3635a-45ea-a914-6539-cac63df1d3cf]5215fc31-fb48-d26a-2d4b-ec010bd0a696</obj>
          <skip>false</skip>
        </objectSet>
      </specSet>
      <options>
        <maxObjects>1</maxObjects>
      </options>
    </RetrievePropertiesEx>
  </soapenv:Body>
</soapenv:Envelope>
